//LOADJVID JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//         DD DSN=DSN810.SDSNLOAD,DISP=SHR
//*PASO1: PASO DE BORRADO DE FICHEROS DE SALIDA - IDCAMS
//BORRADO  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE DES.INC.VIDA.MAP.F030619
  SET MAXCC=0
/*
//*LLAMADA AL PGM LOADVID
//LOADVID  EXEC PGM=IKJEFT01
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//FENTRADA DD DSN=DES.TRANS.VIDA.MAP.F300519,DISP=SHR
//FINCIDE  DD DSN=DES.INC.VIDA.MAP.F030619,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSIN    DD *
//SYSTSIN  DD *
DSN SYSTEM(DB8G)
RUN PROGRAM(LOADVID)
END
