//CLIVALJ2 JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//       DD DSN=DSN810.SDSNLOAD,DISP=SHR
//* PGM QUE CONSULTA A DAREPOS EL ESTADO DEL PGM QUE ENTRA POR SYSIN
//* Y ENVIA UN RETURN-CODE DE 0 EN CASO QUE EL PGM NO ACABO EN LA
//* ANTERIROR EJECIVION Y 1 SI ACABO O ES LA PRIMERA EJECUCION
//PASO01   EXEC PGM=IKJEFT01
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSIN    DD *
CLIVACR2
//SYSTSIN DD *
DSN SYSTEM(DB8G)
RUN PROGRAM(SELDAREP)
END
/*
//* EJECUCION DE PRM NORMAL CON BORRADO SI LA CONSULTA A DAREPOS ES
//* DE PGM NO ENCONTRADO O ESTADO OK
//BORRADO  EXEC PGM=IDCAMS,COND=(0,EQ,PASO01)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE DES.VAL.CLI.NMAPFRE.F091024
  SET MAXCC=0
/*
//*LLAMADA AL PROGRAMA CLIVALJ2 QUE CREA EL FICHERO
//PASO02   EXEC PGM=IKJEFT01,COND=(0,EQ,PASO01)
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//FSALIDA  DD DSN=DES.VAL.CLI.NMAPFRE.F091024,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSIN    DD *
//SYSTSIN DD *
DSN SYSTEM(DB8G)
RUN PROGRAM(CLIVACR2)
END
/*
//*LLAMADA AL PROGRAMA CLIVALJ2 DE REPOSICIONAMIENTO
//PASO03   EXEC PGM=IKJEFT01,COND=(1,EQ,PASO01)
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//FSALIDA  DD DSN=DES.VAL.CLI.NMAPFRE.F091024,
//            DISP=(MOD,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSIN    DD *
//SYSTSIN DD *
DSN SYSTEM(DB8G)
RUN PROGRAM(CLIVACR2)
END
/*
