//JCLCURP  JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//         DD DSN=DSN810.SDSNLOAD,DISP=SHR
//* PASO DE BORRADO
//BORRAR   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
 DELETE DES.CBCURPR.SALIDA
 SET MAXCC=0
/*
//* PASO DE LLAMADA A PROGRAMA CBCURPR
//CBCURPR  EXEC PGM=IKJEFT01
//SALIDA   DD DSN=DES.CBCURPR.SALIDA,
//            DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=22,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSIN    DD *
/*
//SYSTSIN  DD *
DSN SYSTEM(DB8G)
RUN PROGRAM(CBCURPR)
END
/*
