//JCLDB2   JOB NOTIFY=&SYSUID
//*LIBRERIA DE COMUNICACION CON LOS EJECUTABLES DE LOS PGMS COBOL
//*LIBRERIA DE COMUNICACION CON DB2
//JOBLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//       DD DSN=DSN810.SDSNLOAD,DISP=SHR
//*BORRADO PREVIO DE FICHEROS DE SALIDA
//*BORRADO EXEC PGM=IDCAMS
//*SYSPRINT DD SYSOUT=*
//*SYSIN    DD *
//*  DELETE DES.FICHERO.CONSUMOS.OUT.F050924
//*  DELETE DES.FICHERO.CONSUMOS.ERR.F050924
//*  SET MAXCC=0
//*
//*EJECUCION DEL PGM PGMDB2
//PGMDB2   EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//FENTRADA DD DSN=DES.FICHERO.DATOS.AUTORES,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
/*
//SYSTSIN DD *
DSN SYSTEM(DB8G)
RUN PROGRAM(PGMDB2)
END
/*
