//EJJCLC01 JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//         DD DSN=DSN810.SDSNLOAD,DISP=SHR
//* BORRADO DE FICHEROS
//BORRAR   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
 DELETE DES.FICHERO.EJJCLC01.SALIDA
 SET MAXCC=0
/*
//* BIND DE PLANES
//BIND     EXEC PGM=IKJEFT01
//DBRMLIB  DD   DSN=IBMUSER.COBOL.DBRMLIB,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSTSIN   DD *
DSN SYSTEM(DB8G)
BIND PLAN(EJPGMC01) MEMBER(EJPGMC01,EJRUTC01)
END
/*
//* LLAMADA A PROGRAMA
//EJPGMC01 EXEC PGM=IKJEFT01
//SYSTSPRT  DD SYSOUT=*
//ENTRADA  DD DSN=DES.FICHERO.CLIENTE,DISP=SHR
//SALID1   DD DSN=DES.FICHERO.EJJCLC01.SALIDA,
//            DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=113,BLKSIZE=0)
//SYSIN    DD *
/*
//SYSTSIN   DD *
DSN SYSTEM(DB8G)
RUN PROGRAM(EJPGMC01) PLAN(EJPGMC01)
END
/*
