//JCLMATPO JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//* PASO DE BORRADO
//BORRAR   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE DES.FICHERO.CLIENTES.ORDEN
  DELETE DES.FICHERO.POLIZAS.ORDEN
  DELETE DES.FICHERO.MATPOLI.SALIDA
  SET MAXCC=0
/*
//* PASO DE SORT01
//SORT01   EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SORTIN   DD DSN=DES.FICHERO.CLIENTES,DISP=SHR
//SORTOUT  DD DSN=DES.FICHERO.CLIENTES.ORDEN,
//            DISP=(,CATLG,DELETE),SPACE=(TRK,(1,1))
//SYSIN    DD *
  SORT FIELDS=(1,11,CH,A)
/*
//* PASO DE SORT02
//SORT02   EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SORTIN   DD DSN=DES.FICHERO.POLIZAS,DISP=SHR
//SORTOUT  DD DSN=DES.FICHERO.POLIZAS.ORDEN,
//            DISP=(,CATLG,DELETE),SPACE=(TRK,(1,1))
//SYSIN    DD *
  SORT FIELDS=(12,11,CH,A)
/*
//* PASO DE LLAMADA A PROGRAMA PGMCOBOL
//PASO01   EXEC PGM=MATPOLI
//SYSOUT   DD SYSOUT=*
//CLIENTES DD DSN=DES.FICHERO.CLIENTES.ORDEN,DISP=SHR
//POLIZAS  DD DSN=DES.FICHERO.POLIZAS.ORDEN,DISP=SHR
//SALIDA   DD DSN=DES.FICHERO.MATPOLI.SALIDA,
//            DISP=(,CATLG,DELETE),SPACE=(TRK,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
/*
