//JCLMPRDI JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//*PASO1: PASO DE BORRADO DE FICHEROS DE SALIDA - IDCAMS
//BORRADO  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE DES.FICHSAL.PROVIN.ORDEN
  DELETE DES.FICHSAL.DIRELEC.ORDEN
  DELETE DES.FICHSAL.MPRODIR
  SET MAXCC=0
/*
//*PASO2: ORDENAR POR PREFIJO PROVINCIA Y DIRELEC
//ORDEN1   EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=DES.FICHSAL.PROVIN,DISP=SHR
//SORTOUT  DD DSN=DES.FICHSAL.PROVIN.ORDEN,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  SORT FIELDS=(1,2,CH,A)
/*
//ORDEN2   EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=DES.FICHSAL.DIRELEC,DISP=SHR
//SORTOUT  DD DSN=DES.FICHSAL.DIRELEC.ORDEN,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  SORT FIELDS=(4,20,CH,A)
/*
//*LLAMADA AL PROGRAMA PGMMPRDI
//PGMMPRDI EXEC PGM=PGMMPRDI
//FPROVIN  DD DSN=DES.FICHSAL.PROVIN.ORDEN,DISP=SHR
//FDIRELE  DD DSN=DES.FICHSAL.DIRELEC.ORDEN,DISP=SHR
//FSALIDA  DD DSN=DES.FICHSAL.MPRODIR,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSIN    DD *
//SYSTSIN  DD *
/*
