//VALJSNMA JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//BORRADO  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE DES.UNLOAD.ENT.COMPANIA.ORDENA
  DELETE DES.UNLOAD.ENT.SEGUROS.ORDENA
  DELETE DES.VAL.SEG.NMAPFRE.F280519
  DELETE DES.VAL.SEG.DESCART.F280519
  SET MAXCC=0
/*
//*PASO DE ORDENACION DEL FICHERO COMPANIAS-SEGUROS POR NUMERO-POLIZA
//*Y FILTRAMOS LOS REGISTROS POR NO MAPFRE
//SORT01   EXEC PGM=SORT
//SORTIN   DD DSN=DES.UNLOAD.ENT.COMPANIA.F220519,DISP=SHR
//SORTOUT  DD DSN=DES.UNLOAD.ENT.COMPANIA.ORDENA,
//            DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(5,5),RLSE)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  SORT FIELDS=(5,9,CH,A)
  INCLUDE COND=(14,55,CH,NE,C'MAPFRE')
/*
//*PASO DE ORDENACION DEL FICHERO SEGUROS-PEPITO-SEG POR NUMERO-POLIZA
//SORT02   EXEC PGM=SORT
//SORTIN   DD DSN=DES.UNLOAD.ENT.SEGUROS.F220519,DISP=SHR
//SORTOUT  DD DSN=DES.UNLOAD.ENT.SEGUROS.ORDENA,
//            DISP=(,CATLG,DELETE),
//            SPACE=(TRK,(5,5),RLSE)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  SORT FIELDS=(1,9,CH,A)
/*
//*LLAMADA AL PROGRAMA VALSNMAP
//VALSNMAP EXEC PGM=VALSNMAP
//SYSPRINT DD SYSOUT=*
//FCOMPA   DD DSN=DES.UNLOAD.ENT.COMPANIA.ORDENA,DISP=SHR
//FSEGUR   DD DSN=DES.UNLOAD.ENT.SEGUROS.ORDENA,DISP=SHR
//FNOMAP   DD DSN=DES.VAL.SEG.NMAPFRE.F280519,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//FSIMAP   DD DSN=DES.VAL.SEG.DESCART.F280519,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
/*
