//JCLCONS2 JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//BORRADO  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE DES.SER.PGMCONS2.SALIDA
  DELETE DES.SER.PGMCONS2.ERRORES
  SET MAXCC=0
/*
//*LLAMADA AL PROGRAMA PGMPOLI
//PGMCONS2 EXEC PGM=PGMCONS2
//SYSPRINT DD SYSOUT=*
//FENTRADA DD DSN=DES.SER.PGMCONS2.F040924,DISP=SHR
//FSALIDA  DD DSN=DES.SER.PGMCONS2.SALIDA,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//FERROR   DD DSN=DES.SER.PGMCONS2.ERRORES,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
/*
