//EXTJCLI  JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//       DD DSN=DSN810.SDSNLOAD,DISP=SHR
//BORRADO  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE DES.UNLOAD.ENT.CLIENTES.F220519
  SET MAXCC=0
/*
//* BIND DE PLANES
//BIND     EXEC PGM=IKJEFT01
//DBRMLIB  DD   DSN=IBMUSER.COBOL.DBRMLIB,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSTSIN   DD *
DSN SYSTEM(DB8G)
BIND PLAN(EXTCLI) MEMBER(EXTCLI, EXTRCLI)
END
/*
//*LLAMADA AL PROGRAMA EXTCLI
//EXTCLI   EXEC PGM=IKJEFT01
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//FSALIDA  DD DSN=DES.UNLOAD.ENT.CLIENTES.F220519,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSIN    DD *
//SYSTSIN DD *
DSN SYSTEM(DB8G)
RUN PROGRAM(EXTCLI) PLAN(EXTCLI)
END
/*
