//EXTJCOM JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//       DD DSN=DSN810.SDSNLOAD,DISP=SHR
//BORRADO  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE DES.UNLOAD.ENT.COMPANIA.F220519
  SET MAXCC=0
/*
//*LLAMADA AL PROGRAMA EXTCOM
//EXTCOM   EXEC PGM=IKJEFT01
//SYSOUT   DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//FSALIDA  DD DSN=DES.UNLOAD.ENT.COMPANIA.F220519,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSIN    DD *
//SYSTSIN DD *
DSN SYSTEM(DB8G)
RUN PROGRAM(EXTCOM)
END
/*
