//JCLTBWOR JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=IBMUSER.COBOL.LOAD,DISP=SHR
//BORRADO  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE DES.SER.PAPEL.VENTAS.SALIDA
  DELETE DES.SER.PAPEL.ERRORES
  DELETE DES.SER.PAPEL.TBWORK.SALIDA
  SET MAXCC=0
/*
//*LLAMADA AL PROGRAMA PGMTBWOR
//PGMTBWOR EXEC PGM=PGMTBWOR
//SYSPRINT DD SYSOUT=*
//FENTRADA DD DSN=DES.SER.PAPEL.F290824,DISP=SHR
//FTBWORK  DD DSN=DES.SER.DATOS.TBWOR.PAPEL,DISP=SHR
//FSALIDA  DD DSN=DES.SER.PAPEL.VENTAS.SALIDA,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//FERROR   DD DSN=DES.SER.PAPEL.ERRORES,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//FTBSAL   DD DSN=DES.SER.PAPEL.TBWORK.SALIDA,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(100,20),RLSE)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
/*
